OpenFOAM/QHDFoam/QHDFoam-OFv1912/cases/backwardStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0)   // 0
	(10 0 0)  // 1
	(-1 1 0)  // 2
	(0 1 0)   // 3
	(10 1 0)  // 4
	(-1 2 0)  // 5
	(0 2 0)   // 6
	(10 2 0)  // 7

        (0 0 0.05)   // 8
	(10 0 0.05)  // 9
	(-1 1 0.05)  // 10
	(0 1 0.05)   // 11
	(10 1 0.05)  // 12
	(-1 2 0.05)  // 13
	(0 2 0.05)   // 14
	(10 2 0.05)  // 15
);

blocks
(
    hex (0 1 4 3 8  9  12 11) (200 20 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) ( 20 20 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (200 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 5 13 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1  9  8)
            (0 3 11  8)
            (2 3 11 10)
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    symwall
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (2 3 6 5)
            (3 4 7 6)
            (8 9 12 11)
            (10 11 14 13)
            (11 12 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
